{
  "videos": [
    {
      "id": "0C8mQoV-Xpg",
      "title": "Speediance Fixed Progressive Overload (Mostly)",
      "description": "The one V3.1 change that actually improves your training — progressive overload now prompts you before adding weight on bilateral and bar movements. I demo it live during warm-up sets and explain why this matters more than Safety Start ever will.\n\nI also cover why Safety Start actually limits your range of motion (making it dangerous for real lifting), the philosophy behind concentric limiting + eccentric loading for joint safety, and the unilateral bugs that still need fixing. 75,000+ lbs lifted on V3.1 already.\n\n**Timestamps:**\n0:00 - Real Lifting Demo & Weight Behavior\n1:01 - Why Auto-Off Matters for Safety\n4:58 - Safety Start Limits Your Range of Motion\n5:22 - Eccentric Loading Philosophy (Why I Use These Machines)\n6:42 - Unilateral Movement Bugs Still Present\n7:12 - 1RM Settings Deep Dive\n10:00 - Workout UI & Eccentric Mode Improvements\n\n📺 **Full 64-minute review:** https://youtu.be/ZbEstduW90I\n\nI own both the original Speediance and the 2S. Over 1.2 million pounds lifted across both machines. This is real training feedback from someone who uses these machines daily.\n\n#Speediance #ProgressiveOverload #EccentricTraining #SmartGym #HomeGym #FitnessTech #ResistanceTraining #ConnectedFitness #StrengthTraining #GymReview",
      "thumbnail": "https://i.ytimg.com/vi/0C8mQoV-Xpg/maxresdefault.jpg",
      "publishedAt": "2026-02-18T17:42:32Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-02-18_Speediance_Fixed_Progressive_Overload_Mostly.txt",
      "has_transcript": true
    },
    {
      "id": "xFknwPPhVnI",
      "title": "OpenClaw basics, current setup, my primary use case",
      "description": "🤖 I Built an AI Assistant That Manages My Entire Fitness Life\nMeet my custom AI assistant — built on OpenClaw — that handles everything from tracking my BJJ training to analyzing my recovery data. Here's what it does:\nMorning & Nightly Health Reports ☀️🌙\nEvery morning, I get a detailed report covering:\nRecovery score from WHOOP\nTraining load & strain\nSleep quality\nNutrition status from Cronometer\nWorkout summary from Speediance\n\nBJJ Buddy App 🥋\nA custom iOS/Android app I built that tracks:\n150+ Brazilian Jiu-Jitsu techniques\nFilter by position, belt level, and technique type\nFavorites & training history\nVideo links for every technique\n\nThe Tech Stack:\nOpenClaw AI gateway\nMultiple AI models (Claude, Gemini, Mistral, MiniMax)\nCustom Node.js backend\nReact Native (Expo) for the app\n\nWhat makes this different:\nThis isn't just a chatbot — it's a personalized fitness command center that learns my training patterns, automatically pulls data from my wearable devices, and gives me actionable insights every single day.",
      "thumbnail": "https://i.ytimg.com/vi/xFknwPPhVnI/sddefault.jpg",
      "publishedAt": "2026-02-18T11:54:35Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-02-18_OpenClaw_basics_current_setup_my_primary_use_case.txt",
      "has_transcript": true
    },
    {
      "id": "MsdQU6uuHaE",
      "title": "BJJ Buddy Progress, OpenClaw basics/setup, my use cases",
      "description": "🤖 I Built an AI Assistant That Manages My Entire Fitness Life\nMeet my custom AI assistant — built on OpenClaw — that handles everything from tracking my BJJ training to analyzing my recovery data. Here's what it does:\nMorning & Nightly Health Reports ☀️🌙\nEvery morning, I get a detailed report covering:\nRecovery score from WHOOP\nTraining load & strain\nSleep quality\nNutrition status from Cronometer\nWorkout summary from Speediance\n\nBJJ Buddy App 🥋\nA custom iOS/Android app I built that tracks:\n150+ Brazilian Jiu-Jitsu techniques\nFilter by position, belt level, and technique type\nFavorites & training history\nVideo links for every technique\n\nThe Tech Stack:\nOpenClaw AI gateway\nMultiple AI models (Claude, Gemini, Mistral, MiniMax)\nCustom Node.js backend\nReact Native (Expo) for the app\n\nWhat makes this different:\nThis isn't just a chatbot — it's a personalized fitness command center that learns my training patterns, automatically pulls data from my wearable devices, and gives me actionable insights every single day.",
      "thumbnail": "https://i.ytimg.com/vi/MsdQU6uuHaE/sddefault_live.jpg",
      "publishedAt": "2026-02-18T00:33:57Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "has_transcript": false
    },
    {
      "id": "ZbEstduW90I",
      "title": "Speediance 2S V3.1 Review: New Safety Start, Firmware Changes & Real‑World Lifting",
      "description": "Speediance V3.1 is here on my upstairs 2S, and after a few days of real workouts with the new firmware, I’m convinced “Safety Start” is not the safety feature it’s advertised to be.  In this video I walk through the good, the bad, and the ugly of the V3.1 software and firmware combo, including slower cable retraction, unsafe slack behavior, and a massive downgrade to partner and dual‑load modes compared to the old software.\nWe’ll test Safety Start in free lift, barbell, and handle movements, and I’ll show why it was clearly built to support upcoming Pilates features rather than to actually fix the real safety problems lifters were seeing.  I also demo how the new firmware makes retraction noticeably worse than on my original Speediance downstairs, why dual‑load mode is more broken than ever, and how bringing back partner lifting without independent sides or a true guest profile is a step backward, not an upgrade.\nIf you own a Speediance 2S or original Gym Monster and you’re wondering whether to update, how to stay safe with heavy eccentric work, and whether Safety Start should be part of your normal setup, this breakdown is for you.  I’ll also cover how I actually lift (warm‑ups, one‑second pause vs relying on software “safety,” and why I’d rather risk the machine than my spine) so you can decide what makes sense in your own home gym.\nTimestamps (edit to taste):\n • 00:00 Intro – Speediance 2S vs original and V3.1 context\n • 03:10 New firmware, retraction changes, and why it feels worse\n • 08:25 Safety Start demo in free lift (and why I almost never use it)\n • 15:40 Dual‑load & partner mode: from real safety feature to downgrade\n • 24:10 Guest profiles, missing second user support, and UI gaps\n • 32:00 When Safety Start “helps” vs when it hurts your range of motion\n • 40:15 My real‑world lifting workflow and safety priorities\nIf you like deep‑dive Speediance testing, honest firmware reviews, and real training use cases (not just promo clips), hit like, subscribe, and drop your questions in the comments so I can test them in future videos.\nSuggested tags/keywords (copy/paste + tweak):\nspeediance v3.1, speediance 2s, speediance firmware, speediance safety start, speediance retraction issue, speediance partner mode, speediance dual load, speediance review, smart home gym, digital weight, tonal vs speediance, fitness tech, toby on fitness tech",
      "thumbnail": "https://i.ytimg.com/vi/ZbEstduW90I/maxresdefault.jpg",
      "publishedAt": "2026-02-04T01:01:02Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-02-04_Speediance_2S_V31_Review_New_Safety_Start_Firmware_Changes_RealWorld_Lifting.txt",
      "has_transcript": true
    },
    {
      "id": "DvBzOcR-RXo",
      "title": "The 'Levels' of Jiu-Jitsu: Tying My Pants Mid-Roll",
      "description": "Full Video Link: https://youtu.be/JxRdaMTOOHo?si=NwJPmwhtmQxRa7N1\n\nWitnessing a masterclass in psychological warfare on the mats. When one practitioner pauses a full-throttle exchange simply to adjust their gi pants, the message to the lower-ranked opponent is unmistakable. This small, seemingly casual act speaks volumes about the deep, unspoken hierarchy and experience gap between ranks in the art. It's not about the knot; it's about the sheer confidence to stop the fight and fix it while the other person is giving it their all. A fascinating peek behind the curtain of grappling confidence.\n#BJJ #JiuJitsu #MartialArts #Grappling #BeltLevels #BJJLife #SubmissionGrappling",
      "thumbnail": "https://i.ytimg.com/vi/DvBzOcR-RXo/maxresdefault.jpg",
      "publishedAt": "2026-01-31T10:01:39Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-31_The_Levels_of_Jiu-Jitsu_Tying_My_Pants_Mid-Roll.txt",
      "has_transcript": true
    },
    {
      "id": "Qy61dHyFWK4",
      "title": "I was 238 lbs with a broken ankle",
      "description": "Full Video Link: https://youtu.be/JxRdaMTOOHo?si=NwJPmwhtmQxRa7N1\nWitnessing the unfiltered moment a creator shares their weight after a vacation where a broken ankle made mobility impossible. Navigating a cruise ship with a boot and brace, relying on elevators, led to a 238-pound reality check fueled by non-stop cruise dining. An honest look at how circumstances derail even the best intentions, and the essential role of support systems during tough times.\n#fitness #weightlossjourney #brokenankle #cruisevacation #bodyupdate #transformation",
      "thumbnail": "https://i.ytimg.com/vi/Qy61dHyFWK4/maxresdefault.jpg",
      "publishedAt": "2026-01-31T00:01:39Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-31_I_was_238_lbs_with_a_broken_ankle.txt",
      "has_transcript": true
    },
    {
      "id": "uDbTWHWFnvs",
      "title": "My Top 3 Fitness Priorities for 2026",
      "description": "Full Video Link: https://youtu.be/JxRdaMTOOHo?si=NwJPmwhtmQxRa7N1\n\nWitness the compelling internal shift as this fitness enthusiast re-calibrates their entire training year. After a major physical transformation, the primary objective for 2026 pivots sharply toward conquering a 4-mile race, even over long-held favorites like Jujitsu or heavy lifting. It’s a masterclass in goal re-prioritization—a strategy that also informs when a specific training split is truly the right tool for the job. A refreshing look at setting realistic, layered fitness objectives.\n#FitnessGoals #TrainingPriorities #RunningComeback #FitnessJourney #GoalSetting #FitnessTips",
      "thumbnail": "https://i.ytimg.com/vi/uDbTWHWFnvs/maxresdefault.jpg",
      "publishedAt": "2026-01-30T11:01:42Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-30_My_Top_3_Fitness_Priorities_for_2026.txt",
      "has_transcript": true
    },
    {
      "id": "-za9-uOurew",
      "title": "Tonal vs. Speediance: The Arnold Blueprint Problem",
      "description": "When translating the legendary Arnold Blueprint to the Tonal platform, unexpected cracks appear. The adaptation splits routines and necessitates exercises that the machine simply cannot perform. For sheer variety, the Tonal library pales in comparison to what other modern equipment, like Speediance, can offer. Discover the significant trade-offs made in this popular tech implementation.\n#tonal #speediance #arnoldblueprint #fitnesstech #strengthtraining #smartgym #workoutsplit",
      "thumbnail": "https://i.ytimg.com/vi/-za9-uOurew/maxresdefault.jpg",
      "publishedAt": "2026-01-30T00:00:39Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-30_Tonal_vs_Speediance_The_Arnold_Blueprint_Problem.txt",
      "has_transcript": true
    },
    {
      "id": "lqbKTG9tRog",
      "title": "How One Month of No Training 'Aged' My Body",
      "description": "The raw data on body age tracking shows a stark consequence: zero training for thirty days resulted in the metric reporting an age older than reality. It serves as a powerful, immediate feedback loop on consistency, contrasting sharply with the rigorous Push-Pull-Legs schedule previously employed to achieve significant results from obesity. A sobering look at what happens when consistency vanishes, even for those who've mastered fitness technology.\n#fitness #tracker #body #composition #training #splits #push #pull #legs #workout #routine #fitness #motivation #biohacking #health #tech",
      "thumbnail": "https://i.ytimg.com/vi/lqbKTG9tRog/maxresdefault.jpg",
      "publishedAt": "2026-01-29T11:00:43Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-29_How_One_Month_of_No_Training_Aged_My_Body.txt",
      "has_transcript": true
    },
    {
      "id": "skiltOPni7I",
      "title": "Why Whoop 5 Design Feels Intentionally Malicious",
      "description": "A deep dive into the new Whoop 5 hardware reveals a pattern users are calling out. It appears that the form factor shift, which renders previous generations of bands unusable, wasn't merely a byproduct of a new thickness. The analysis suggests this was a trade-off made to enable marketing the device as \"smaller,\" potentially at the expense of customer investment in older gear. See the breakdown of why this specific design choice leaves dedicated Whoop customers feeling like their previous accessories were intentionally bricked.\n#Whoop #Whoop5 #WearableTech #FitnessTracker #TechReview #SmartDevice",
      "thumbnail": "https://i.ytimg.com/vi/skiltOPni7I/maxresdefault.jpg",
      "publishedAt": "2026-01-29T00:30:51Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-29_Why_Whoop_5_Design_Feels_Intentionally_Malicious.txt",
      "has_transcript": true
    },
    {
      "id": "ucYb0Bg4XrA",
      "title": "Why Running Might Have Saved My Life",
      "description": "Witness a raw account where years on the pavement potentially averted a medical disaster, highlighting the unsung hero of fitness: the heart. The creator explores the crucial role of cardiovascular work, even when the physique is built primarily through iron. A powerful look at fitness beyond the mirror, revealing why the actual training blueprint used for an extreme transformation is more nuanced than a simple program.\n#fitnessjourney #hearthealth #runningbenefits #strengthtraining #trainingsplit #fitnessmotivation #cardiovsweights",
      "thumbnail": "https://i.ytimg.com/vi/ucYb0Bg4XrA/maxresdefault.jpg",
      "publishedAt": "2026-01-28T11:01:39Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-28_Why_Running_Might_Have_Saved_My_Life.txt",
      "has_transcript": true
    },
    {
      "id": "v3ecjkDIJng",
      "title": "The training that built my physique isn't what I do today",
      "description": "The intense six-month journey from morbidly obese to fit using an Arnold Blueprint-style push-pull-legs split on Tonal in 2023 is finally detailed. However, the true revelation is the complete shift in training strategy afterward. Discover the nuanced perspective on why the blueprint that built this physique is no longer the one being used today, highlighting how goals, recovery, and schedule dictate ultimate programming success. A fascinating deep dive into evolving fitness strategy.\n#Transformation #FitnessJourney #WorkoutSplit #SixMonthTransformation #TrainingProgram #FitnessTips #Bodybuilding",
      "thumbnail": "https://i.ytimg.com/vi/v3ecjkDIJng/maxresdefault.jpg",
      "publishedAt": "2026-01-28T02:05:50Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-28_The_training_that_built_my_physique_isnt_what_I_do_today.txt",
      "has_transcript": true
    },
    {
      "id": "yxAHXtajmp0",
      "title": "Why I Use Garmin (Even Though Its Metrics Are Questionable)",
      "description": "The consensus seems to be that for serious training data, the top contender shines brightest only when its digital distractions are silenced. One reviewer shares their surprising truth: the device they rely on daily is only valuable once the sleep tracking, body battery gauges, and other typical smartwatch functions are completely disabled. A fascinating look at prioritizing pure function over feature bloat in fitness tech.\n#Garmin #FitnessTech #SmartwatchReview #WearableTech #FitnessGadgets #BestGPSWatch",
      "thumbnail": "https://i.ytimg.com/vi/yxAHXtajmp0/maxresdefault.jpg",
      "publishedAt": "2026-01-27T17:46:02Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-27_Why_I_Use_Garmin_Even_Though_Its_Metrics_Are_Questionable.txt",
      "has_transcript": true
    },
    {
      "id": "-BuRtR6WNOc",
      "title": "Speediance V3 Software Is Here… But Is It Good?",
      "description": "In today’s video I’m upstairs with the Speediance Gym Monster 2s running the new V3 software, and I want to break down why this update is both an upgrade for me and a frustrating step backwards for a lot of power users.\nI’ll walk through what actually changed in the V3 UI, why Free Lift partner mode disappeared, how the new Safety Start feature is supposed to work, and why my 2S currently shows a dead “firmware too low” button. I’ll also explain who the Speediance is not for—especially if your spouse wants a fully coached, English‑speaking female trainer experience—and why, even after 10M lbs on Tonal and over 1M lbs on Speediance, I still consider this hardware an upgrade.\nWe’ll talk about why I mute coach audio and only use system sounds, how I set up eccentric‑focused custom workouts, and why bringing the handles back under load to the rubber stoppers is one of my favorite advantages over Tonal’s plastic‑on‑plastic design. I also dig into Speediance’s “family” and Workout Plus marketing, why you still can’t truly do custom partner/family workouts together, and what a good partner mode implementation should actually look like in Free Lift and Wellness/Workout Plus.\nIf you’re debating Tonal vs Speediance, wondering what V3 really changes, or trying to decide whether this smart gym will work for you and your partner, this video should give you a real‑world, heavy‑use perspective instead of just brochure specs.\nTimestamps (adjust as needed):\n0:00 Intro – V3 software and who Speediance is NOT for\n2:10 Female coach situation (English vs Spanish) and guided workouts\n5:25 Why Speediance was an upgrade over Tonal for me\n8:40 V3 UX changes, sliders, and nagware they finally removed\n13:05 Free Lift partner mode: what we lost in V3\n18:30 Safety Start, firmware issues on the 2S, and my lifting style\n24:10 Hardware limitations, Tonal 2 parallels, and new features only on newer units\n29:00 “Family” / Workout Plus plan and why it still isn’t real family training\n34:00 What I want from partner mode and final thoughts on V3\nIf you like deep‑dive smart gym content, honest UX breakdowns, and real training talk (not just promo reels), hit like, drop your questions in the comments, and subscribe so you don’t miss future Speediance and Tonal updates.",
      "thumbnail": "https://i.ytimg.com/vi/-BuRtR6WNOc/maxresdefault.jpg",
      "publishedAt": "2026-01-27T17:04:50Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-27_Speediance_V3_Software_Is_Here_But_Is_It_Good.txt",
      "has_transcript": true
    },
    {
      "id": "wMT8i8E14NU",
      "title": "Speediance Broke Partner Mode?! The “Lost” Free Lift Feature Demo With My Daughter",
      "description": "Today on Toby on Fitness Tech, Lily and I dive into a “lost” Speediance feature: the original Free Lift partner mode from the V2 software that disappeared when I upgraded my upstairs Gym Monster to V3. This is the version they used in the early Speediance demos, and it shows off something Tonal simply can’t do: two independent motors letting two people lift different weights, at the same time, on the same machine.\nWe walk through how this older partner mode works inside Free Lift, why it never really tracked guests properly, how the Bluetooth handles behave, and why it ends up feeling more like a “fun functional trainer” than a serious progressive-overload tool. You’ll see Lily and me lifting side‑by‑side with separate resistance, comparing rep counts, watching the dual power graphs (green vs yellow lines), and even testing assist modes that auto‑drop the weight mid‑rep.\nI also break down the tradeoffs between V2 and V3: what’s actually been removed, what’s still in the newer software (like the redesigned Free Lift screen and dynamic modes), and why the community expects some version of this “true” partner mode to return in a future update. If you own a Speediance or you’re comparing it to Tonal, this is a great real‑world look at how dual‑motor design changes what’s possible for family training and kid‑friendly workouts.\n\nTimestamps:\n0:00 Intro & why this feature vanished in V3\n1:10 V2 vs V3 partner modes explained\n3:45 Free Lift partner mode demo with Lily\n8:20 Why Tonal can’t do this style of partner lifting\n12:05 Assist modes, safety, and kids on digital weight\n16:30 Why I still don’t program real workouts in this mode\n\nIf you like seeing real‑world Speediance testing, father‑daughter workouts, and honest smart‑gym breakdowns, make sure to like and subscribe so we can keep experimenting with features before they disappear.",
      "thumbnail": "https://i.ytimg.com/vi/wMT8i8E14NU/maxresdefault.jpg",
      "publishedAt": "2026-01-24T19:30:14Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-24_Speediance_Broke_Partner_Mode_The_Lost_Free_Lift_Feature_Demo_With_My_Daughter.txt",
      "has_transcript": true
    },
    {
      "id": "4DEbSwFWeXY",
      "title": "Why I Stopped Lifting Every Day: My 41,500lb Workout Strategy",
      "description": "Forget the standard 'push-pull-legs' dogma! This creator reveals the counter-intuitive truth behind achieving a massive body recomposition while in a steep calorie deficit. Witness the actual 41,500-pound workout structure that fueled a remarkable six-month transformation. Learn why adapting the training split based on current recovery and the daily schedule is the real secret weapon, rather than sticking rigidly to a pre-set routine. It's a deep dive into the highly specific, Arnold Blueprint-inspired intensity used to go from morbidly obese to fit.\n#fitnessmotivation #liftingstrategy #workoutsplit #bodytransformation #strengthtraining #liftingheavy #caloriedeficit #tonalworkout #arnoldblueprint",
      "thumbnail": "https://i.ytimg.com/vi/4DEbSwFWeXY/maxresdefault.jpg",
      "publishedAt": "2026-01-18T16:43:50Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-18_Why_I_Stopped_Lifting_Every_Day_My_41500lb_Workout_Strategy.txt",
      "has_transcript": true
    },
    {
      "id": "nxsD-MZljM8",
      "title": "Full Body Minus Legs: My Current Training Split Explained",
      "description": "My current full body workout routine, why you switched from PPL, the 41.5K calorie burn workouts, exercise selection philosophy, and how I structure my training blocks. Clipped from the full video available https://www.youtube.com/watch?v=JxRdaMTOOHo",
      "thumbnail": "https://i.ytimg.com/vi/nxsD-MZljM8/maxresdefault.jpg",
      "publishedAt": "2026-01-18T12:59:08Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-18_Full_Body_Minus_Legs_My_Current_Training_Split_Explained.txt",
      "has_transcript": true
    },
    {
      "id": "apsAL3x_V3k",
      "title": "Whoop vs Garmin for Jiu-Jitsu & Strength Training: Honest Review",
      "description": "Your experience with Whoop vs Garmin for tracking jiu-jitsu and strength training, why you're downgrading from Whoop 5.0 Life to Peak, blood pressure monitoring with Whoop, and limitations of current fitness trackers.\nThis video was clipped from the full video here: https://www.youtube.com/watch?v=JxRdaMTOOHo",
      "thumbnail": "https://i.ytimg.com/vi/apsAL3x_V3k/maxresdefault.jpg",
      "publishedAt": "2026-01-16T22:00:06Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-16_Whoop_vs_Garmin_for_Jiu-Jitsu_Strength_Training_Honest_Review.txt",
      "has_transcript": true
    },
    {
      "id": "fQJXgRY4QKw",
      "title": "Why Your Fitness Tracker Might Be Lying To You",
      "description": "Viewers are often told to trust their wearable data implicitly, but this footage throws a serious wrench in that assumption. Witness the moment a demanding strength session drives the Garmin Body Battery down to an almost unheard-of 5%. It’s a stark illustration of how intensely a workout impacts the body's readiness score—far beyond just logging time. This challenges the simple training talk, hinting at a deeper connection between programmed intensity (like the Arnold Blueprint methods used during a massive deficit) and the device's assessment of true fatigue. The big question remains: is the device accurately capturing the overload, or is this just a system glitch? The full analysis reveals what this recovery metric *really* means for tracking intense training periods.\n#fitness #tracker #accuracy #body #battery #recovery #tracking #strength #training #results #workout #intensity #garmin #insights #fitness #tech #explained #training #splits #secrets",
      "thumbnail": "https://i.ytimg.com/vi/fQJXgRY4QKw/maxresdefault.jpg",
      "publishedAt": "2026-01-16T02:05:43Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-16_Why_Your_Fitness_Tracker_Might_Be_Lying_To_You.txt",
      "has_transcript": true
    },
    {
      "id": "5Qn_7kTJgfQ",
      "title": "The Dangers of Lifting Alone: A Near-Death Bench Press Story",
      "description": "The sheer audacity of attempting a max lift without backup is put into sharp perspective here. The footage captures the split second where an overloaded barbell was dropped, bending dangerously close to snapping—a horrifying testament to what can happen when training heavy alone. Listen to the chilling aftermath of this near-disaster, which underscores the absolute necessity of respecting free weight mechanics, especially when recovery is on the line. This serves as a visceral reminder about the true cost of training in isolation.\n#weightlifting #gym #safety #bench #press #fail #near #miss #training #alone #free #weights #strength #training #fitness #dangers",
      "thumbnail": "https://i.ytimg.com/vi/5Qn_7kTJgfQ/maxresdefault.jpg",
      "publishedAt": "2026-01-15T17:06:37Z",
      "videoOwnerChannelTitle": "Toby Glenn",
      "transcript_file": "2026-01-15_The_Dangers_of_Lifting_Alone_A_Near-Death_Bench_Press_Story.txt",
      "has_transcript": true
    }
  ],
  "fetchedAt": "2026-02-18T20:50Z",
  "channelId": "UCmSwMp2gPo5PGl32d4oCu-Q"
}